$unit.ns("gm.ngi.weibo.TTSTextHandler");
/*
 * 微博语音播报文字预处理
 */
gm.ngi.weibo.TTSTextHandler = function(){
	// 繁体字已排序，支持二分查找
	this.tranditionalChars = "丟並亂亙亞亸佇余來侖侶俁俠倀倆倆倉個們倫偉側偵偽傑傖傘備傭傯傳傴債傷傾僂僅僉僑僥僨價儀儂億儈儉儐儔儕償優儲儷儺儻儼兌兒兗內兩冊冢冪凈凍凜凱別別刪刬制剄則剛剝剮剴創劃劄劇劈劉劊劌劍劑勁動務勚勛勝勞勢勱勵勸勻匭匯匱區協卻厙厭厲厴參叆叇叢只吳呂呵咤咨咼員哢唄唚唝問啞啟啰喉喚喪喬單單喲嗆嗇嗎嗚嗩嗶嘆嘍嘔嘖嘗嘗嘜嘩嘮嘯嘰嘵嘸噅噓噝噠噥噦噯噲噴噸嚀嚇嚌嚕嚙嚦嚨嚳嚴嚶囀囁囂囅囈囑囪圇國圍園圓圖團坰垱垵埡執堅堊堖堝堯報場堿塊塋塏塒塗塢塤塵塹墊墊墜墮墳墻墾壇壓壘壙壚壞壟壟壢壩壯壸壺壽夠夢夥夾奐奧奩奪奮妝妳姍姜娛婁婦婭婳媧媯媼媽嫗嫵嫻嬈嬋嬌嬙嬡嬤嬪嬰嬸孌孫學孿宮寢實寧審寫寬寵寶將專尋對導尷屃屆屍屙屜屢層屨屬岡峃峣峴島峽崄崍崗崠崢崩崳嵐嵚嶁嶄嶇嶗嶠嶧嶴嶸嶺嶼嶽巋巒巔巰巹帥師帳帶幀幃幗幘幟幣幫幬幹幹幾庫庼廁廂廄廈廚廝廟廠廡廢廣廩廬廳弳張強彈彌彎彎彟彥後徑從徠復徹忽怵恥悅悵悶惡惱惲惻愛愜愨愴愷愾態慍慘慚慟慣慪慫慭慮慳慶憂憊憐憑憒憚憤憫憮憲憶懇應懌懍懟懣懨懲懶懷懸懺懼懾戀戇戔戧戩戰戲戶扡拋拼挜挦挾捫掃掄掙掛揀揚換揮損搖搗搶摑摜摟摣摯摳摶摻撈撐撓撚撟撣撥撫撲撳撻撾撿擁擄擇擇擊擋擔據擠擬擯擰擱擲擴擷擺擻擼擾攄攆攏攔攖攙攛攜攝攢攣攤攪攬敗敘敵數斂斃斕斬斷於旸昽時晉晝暈暉暢暫曄曇曉曖曠曬書會朧東松柵梔梘條梟梼梾棄棖棗棟棧棬棲椏楊楓楨業極榪榮榿槁構槍槚槧槨槳樁樂樅樓樓標樞樣樸樹樺橈橋機橢橫檁檉檐檔檜檢檣檳檸檻檾櫃櫓櫚櫛櫝櫞櫟櫥櫧櫨櫪櫫櫬櫳櫸櫻欄權欏欒欖欞欽歐歟歡歲歷歸歿殘殞殤殫殮殯殲殺殼毀毆毿氈氌氣氫氬氳氹汙決沒沒沖沨況洶派浹涇涢涼淒淚淥淩淪淵淶淺渙減渦測渾湊湞湣湧湯溈準溜溝溫滄滅滌滎滪滬滯滲滸滾滾滿漁漚漢漣漬漲漵漸漿潁潑潔潛潤潯潰潷潿澀澆澇澗澠澤澩澮澱濁濃濕濘濟濤濫濫濰濱濺濼濾瀅瀆瀉瀋瀏瀕瀘瀝瀟瀠瀦瀧瀨瀲瀾灃灄灑灘灝灣灤灩災為烏烴無煆煉煒煙煢煥煩煬熒熗熱熾燁燈燉燒燙燜營燦燭燴燼燾爍爐爛爭爺爾爿牘牦牽犖犟犢犧狀狝狹狽猙猛猬猶猻獁獄獅獅獎獨獪獫獰獲獵獷獸獺獻獼玀玚玨玱珰現琺琿瑉瑋瑣瑤瑩瑪璇璉璣璦環璽瓊瓏瓔瓚甌甕產產畝畢畫畬異當疇疊痙瘂瘆瘋瘍瘓瘞瘡瘧瘺療癆癇癉癘癟癡癢癤癧癩癬癭癮癰癱癲發皂皚皰皸皺盜盞盡盡盡監盤盧盯眥眬眾睜睞瞘瞞瞼矚矯矽硁硙硚硤硨硯碩碭碸碹確碼磚磣磧磯磽礎礙礦礪礫礬礱祎祿禍禎禦禪禮禰禱禿秈秾稅稈稟種稱穌積穎穎穡穢穩穭窩窪窮窯窶窺竄竅竇竊競筆筍筜筧箋箏箓節範築篋篤篩篳簀簍簞簡簣簫簽簾籃籌籜籟籠籩籪籬籮籲粵糊糝糞糧糲糴糶糸系糾紀紂約紅紆紇紈紉紋納紐紓純紕紗紙級紛紜紡紮細紱紲紳紹紺紼紿絀終組絆絎結絕絝絞絡絢給絨統絲絳絳絹綁綃綆綈綏經綜綞綠綢綣綬維綰綱網綴綸綹綺綻綽綾綿緄緇緊緋緒緔緗緘緙線緝緞締緡緣緦編緩緬緯緱緲練緶緹縈縉縊縋縐縑縛縝縞縟縣縫縭縮縱縲縵縶縷縹總績繃繅繆繈繒織繕繚繞繡繢繩繪繭繯繰繳繹繼繽繾纈纊續纏纓纖纘纜纮纴纻纼绖绤绬绹缊缐缽罌罰罵罷羅羆羈羋羥羨義習翙翚翹耬耮聖聞聯聰聲聳聵聶職聹聽聾肅脅脈脊脛脫脹腌腎腖腘腡腦腫腭腳腸膁膃膚膠膩膽膾膿臉臍臏臒臘臚臜臟臟臠臥臨與與興舉舊艙艤艦艫艱艷艹芻苧茲荊荙莊莖莢莧華萇萊萬萵葉葒著葤葦葷蒓蒔蒞蒼蓀蓋蓧蓮蓯蓽蔞蔣蔥蔦蔭蕁蕆蕎蕒蕕蕘蕢蕩蕪蕭蕷薈薊薌薔薟薦薩薺藍藎藝藥藪藶藹藺蘄蘆蘇蘊蘋蘚蘞蘢蘭蘺蘿處虛虜號虧虬蛺蛻蜆蝕蝦蝸螀螄螞螢螻蟄蟈蟎蟏蟣蟬蟯蟲蟶蟻蠅蠆蠍蠐蠑蠔蠟蠣蠱蠶蠻術衛衰袆袞袯裈裊裏裏補裝褲褳褸褻襆襇襕襖襝襠襤襪襯襲見規覓視覘覡覦親覬覯覲覷覺覽覿觀觃觍觴觶觸訁訂訃計訊訌討訐訓訕訖記訛訝訟訣訥訪設許訴訶診詁詆詎詐詒詔評詘詛詞詟詠詡詢詣試詩詫詬詭詮詰話該詳詵詼詿誄誅誆誇誌認誑誒誕誘誚語誠誡誣誤誥誦誨說誰課誶誹誼調諂諄談諉請諍諏諑諒論諗諛諜諞諢諤諦諧諫諭諮諱諳諶諷諸諺諼諾謀謁謂謄謅謊謎謐謔謔謖謗謙謚講謝謠謨謫謬謳謹謾證譎譏譖識譙譚譜譫譯議譴護譽譾讀變讎讒讓讕讖讜讞讱讻诇诐诪谞谷豈豎豐豬豮貓貝貝貞負財貢貧貨販貪貫責貯貰貲貳貴貶買貸貺費貼貽貿賀賁賂賃賄賅資賈賊賑賒賓賕賚賜賞賠賡賢賣賤賦賧質賫賬賭賴賺賻購賽賾贄贅贈贊贍贏贐贓贖贗贛贠赒赗赟赪趕趙趨趲跖跡跶踏踐踴蹌蹕蹣蹤蹺躉躊躋躍躑躒躓躕躚躡躥躦躪軀車軋軌軍軒軔軛軟軤軫軲軸軹軺軻軼軾較輅輇載輊輒輔輕輛輜輝輞輟輥輦輩輪輯輳輸輻輾輿轂轄轅轆轉轍轎轔轟轡轢轤轪辀辌辒辦辭辮辯農逕這連進進遊運過達達違遙遜遞遠適遲遷選遺遼邁還邇邊邏邐郁郟郤郵鄆鄉鄒鄔鄖鄧鄭鄰鄲鄴鄶鄺酈酦醜醞醫醬釀釁釃釅釋釓釔釕釗釘釙針釣釤釧釩釬釵釷釹鈀鈁鈄鈈鈉鈍鈐鈑鈔鈕鈞鈣鈥鈦鈧鈰鈳鈴鈷鈸鈹鈺鈽鈾鈿鉀鉅鉆鉈鉉鉍鉑鉕鉗鉚鉛鉞鉤鉦鉬鉭鉸鉺鉻鉿銀銃銅銑銓銖銘銚銜銠銣銥銦銨銩銪銫銬銱銳銷銹銻銼鋁鋃鋅鋇鋌鋏鋒鋝鋟鋣鋤鋥鋦鋨鋪鋯鋰鋱鋶鋸鋼錁錄錆錇錈錐錒錕錘錙錚錟錠錢錦錨錫錮錯錳錸鍁鍆鍇鍋鍍鍔鍘鍛鍤鍥鍬鍰鍵鍶鍺鍾鎂鎄鎊鎖鎘鎢鎣鎦鎧鎪鎬鎮鎰鎳鎿鏃鏇鏈鏌鏍鏑鏗鏘鏜鏞鏟鏡鏢鏤鏨鏵鏷鏹鐃鐋鐐鐒鐓鐔鐘鐘鐙鐝鐠鐦鐧鐫鐮鐲鐳鐵鐸鐺鐿鑄鑊鑒鑔鑠鑣鑥鑭鑰鑲鑷鑹鑼鑾鑿钑钖钘铏铚铦铻锜锠锳锽镃镈镕镠镮镴長門閂閃閆閉開閌閎閏閑閑間閔閘閡閣閥閨閩閫閬閭閱閶閹閻閼閽閾閿闃闈闊闋闌闐闔闕闖關闞闡闥闬闿阇阓阘阛阪陘陜陣陰陳陸陽隉隊階隕際隨險隱隴隸雋雖雙雛雜雞離難雲電霧霽靂靄靈靚靜面靦靨鞏鞽韁韃韉韋韌韓韙韜韝韞韨韻響頁頂頃項順頇須頊頌頎頏預頑頒頓頗領頜頡頤頦頭頰頷頸頹頻顆題額顎顏顓願顙顛類顢顥顧顫顬顯顰顱顳顴颋颎颒颙颣風颮颯颶颼飄飆飈飏飐飔飖飗飛飩飪飫飭飯飲飴飼飽飾餃餅餉養餌餑餒餓餘餛餞餡館餳餷餼餾餿饃饅饈饉饊饋饌饑饒饗饜饞饢饦饳饸饹饻饾馂馃馉馌馎馬馬馭馮馱馳馴駁駐駑駒駔駕駘駙駛駝駟駢駭駱駿騁騅騍騎騏騖騙騫騭騮騰騶騷騸騾驀驁驂驃驄驅驊驍驏驕驗驚驛驟驢驤驥驪驲骃骍骎骔骕骙骦髏體髕髖鬢鬥鬧鬧鬩鬮魎魘魚魯魴魷鮁鮃鮎鮐鮑鮒鮚鮞鮪鮫鮭鮮鯀鯁鯇鯉鯊鯔鯖鯗鯛鯝鯡鯢鯤鯧鯨鯪鯫鯰鯴鯽鯿鰈鰉鰍鰒鰓鰠鰣鰥鰨鰩鰭鰱鰲鰳鰵鰷鰹鰻鰾鱅鱈鱉鱒鱔鱖鱗鱘鱝鱟鱧鱭鱷鱸鱺鱽鱾鲀鲄鲉鲊鲌鲏鲓鲖鲗鲘鲙鲝鲪鲬鲯鲹鲾鲿鳀鳁鳂鳈鳉鳑鳒鳛鳠鳡鳣鳥鳧鳩鳳鳴鳶鴆鴇鴉鴕鴛鴝鴟鴣鴦鴨鴯鴰鴻鴿鵂鵑鵒鵓鵜鵝鵠鵡鵪鵬鵯鵲鶇鶉鶓鶘鶚鶥鶩鶯鶴鶻鶼鶿鷂鷓鷗鷙鷚鷥鷦鷯鷲鷴鷸鷹鷺鸌鸕鸚鸛鸝鸞鸤鸧鸮鸰鸴鸻鸼鹀鹍鹐鹒鹓鹔鹖鹝鹟鹠鹡鹢鹥鹯鹲鹴鹵鹹鹺鹼鹽麅麗麥麩麽黃黌點黡黨黲黴黷黽黿鼉鼌鼗鼴齇齊齋齏齒齔齙齜齟齠齡齦齪齬齲齷龁龂龍龐龔龕龜";
	// 简体字为繁体字的一一对应，未排序，不支持二分
	this.simpleChars = "丢并乱亘亚亸伫余来仑侣俣侠伥俩俩仓个们伦伟侧侦伪杰伧伞备佣偬传伛债伤倾偻仅佥侨侥偾价仪侬亿侩俭傧俦侪偿优储俪傩傥俨兑儿兖内两册冢幂净冻凛凯别别删刬制刭则刚剥剐剀创划札剧劈刘刽刿剑剂劲动务勚勋胜劳势劢励劝匀匦汇匮区协却厍厌厉厣参叆叇丛只吴吕呵吒咨呙员咔呗吣唝问哑启啰喉唤丧乔单单哟呛啬吗呜唢哔叹喽呕啧尝尝唛哗唠啸叽哓呒咴嘘咝哒哝哕嗳哙喷吨咛吓哜噜啮呖咙喾严嘤啭嗫嚣冁呓嘱囱囵国围园圆图团垧垱埯垭执坚垩垴埚尧报场碱块茔垲埘涂坞埙尘堑垫垫坠堕坟墙垦坛压垒圹垆坏垄垄坜坝壮壸壶寿够梦伙夹奂奥奁夺奋妆你姗姜娱娄妇娅婳娲妫媪妈妪妩娴娆婵娇嫱嫒嬷嫔婴婶娈孙学孪宫寝实宁审写宽宠宝将专寻对导尴屃届尸疴屉屡层屦属冈峃峣岘岛峡崄崃岗岽峥崩嵛岚嵚嵝崭岖崂峤峄岙嵘岭屿岳岿峦巅巯卺帅师帐带帧帏帼帻帜币帮帱干干几库庼厕厢厩厦厨厮庙厂庑废广廪庐厅弪张强弹弥弯弯彟彦后径从徕复彻忽憷耻悦怅闷恶恼恽恻爱惬悫怆恺忾态愠惨惭恸惯怄怂慭虑悭庆忧惫怜凭愦惮愤悯怃宪忆恳应怿懔怼懑恹惩懒怀悬忏惧慑恋戆戋戗戬战戏户扦抛拼挜挦挟扪扫抡挣挂拣扬换挥损摇捣抢掴掼搂揸挚抠抟掺捞撑挠捻挢掸拨抚扑揿挞挝捡拥掳择择击挡担据挤拟摈拧搁掷扩撷摆擞撸扰摅撵拢拦撄搀撺携摄攒挛摊搅揽败叙敌数敛毙斓斩断于旸昽时晋昼晕晖畅暂晔昙晓暧旷晒书会胧东松栅栀枧条枭梼梾弃枨枣栋栈桊栖桠杨枫桢业极杩荣桤藁构枪槚椠椁桨桩乐枞楼楼标枢样朴树桦桡桥机椭横檩柽檐档桧检樯槟柠槛苘柜橹榈栉椟橼栎橱槠栌枥橥榇栊榉樱栏权椤栾榄棂钦欧欤欢岁历归殁残殒殇殚殓殡歼杀壳毁殴毵毡氇气氢氩氲凼污决没没冲沨况汹派浃泾涢凉凄泪渌凌沦渊涞浅涣减涡测浑凑浈愍涌汤沩准溜沟温沧灭涤荥滪沪滞渗浒滚滚满渔沤汉涟渍涨溆渐浆颍泼洁潜润浔溃滗涠涩浇涝涧渑泽泶浍淀浊浓湿泞济涛滥滥潍滨溅泺滤滢渎泻渖浏濒泸沥潇潆潴泷濑潋澜沣滠洒滩灏湾滦滟灾为乌烃无煅炼炜烟茕焕烦炀荧炝热炽烨灯炖烧烫焖营灿烛烩烬焘烁炉烂争爷尔丬牍牦牵荦犟犊牺状狝狭狈狰猛猬犹狲犸狱狮狮奖独狯猃狞获猎犷兽獭献猕猡玚珏玱珰现珐珲珉玮琐瑶莹玛璇琏玑瑷环玺琼珑璎瓒瓯瓮产产亩毕画畲异当畴叠痉痖瘆疯疡痪瘗疮疟瘘疗痨痫瘅疠瘪痴痒疖疬癞癣瘿瘾痈瘫癫发皂皑疱皲皱盗盏尽尽尽监盘卢盯眦眬众睁睐眍瞒睑瞩矫硅硁硙硚硖砗砚硕砀砜碹确码砖碜碛矶硗础碍矿砺砾矾砻祎禄祸祯御禅礼祢祷秃籼秾税秆禀种称稣积颖颖穑秽稳稆窝洼穷窑窭窥窜窍窦窃竞笔笋筜笕笺筝箓节范筑箧笃筛筚箦篓箪简篑箫签帘篮筹箨籁笼笾簖篱箩吁粤糊糁粪粮粝籴粜纟系纠纪纣约红纡纥纨纫纹纳纽纾纯纰纱纸级纷纭纺扎细绂绁绅绍绀绋绐绌终组绊绗结绝绔绞络绚给绒统丝绦绦绢绑绡绠绨绥经综缍绿绸绻绶维绾纲网缀纶绺绮绽绰绫绵绲缁紧绯绪绱缃缄缂线缉缎缔缗缘缌编缓缅纬缑缈练缏缇萦缙缢缒绉缣缚缜缟缛县缝缡缩纵缧缦絷缕缥总绩绷缫缪襁缯织缮缭绕绣缋绳绘茧缳缲缴绎继缤缱缬纩续缠缨纤缵缆纮纴纻纼绖绤绬绹缊缐钵罂罚骂罢罗罴羁芈羟羡义习翙翚翘耧耢圣闻联聪声耸聩聂职聍听聋肃胁脉脊胫脱胀腌肾胨腘脶脑肿腭脚肠肷腽肤胶腻胆脍脓脸脐膑癯腊胪臜脏脏脔卧临与与兴举旧舱舣舰舻艰艳艹刍苎兹荆荙庄茎荚苋华苌莱万莴叶荭著荮苇荤莼莳莅苍荪盖莜莲苁荜蒌蒋葱茑荫荨蒇荞荬莸荛蒉荡芜萧蓣荟蓟芗蔷莶荐萨荠蓝荩艺药薮苈蔼蔺蕲芦苏蕴苹藓蔹茏兰蓠萝处虚虏号亏虬蛱蜕蚬蚀虾蜗螀蛳蚂萤蝼蛰蝈螨蟏虮蝉蛲虫蛏蚁蝇虿蝎蛴蝾蚝蜡蛎蛊蚕蛮术卫衰袆衮袯裈袅里里补装裤裢褛亵幞裥襕袄裣裆褴袜衬袭见规觅视觇觋觎亲觊觏觐觑觉览觌观觃觍觞觯触讠订讣计讯讧讨讦训讪讫记讹讶讼诀讷访设许诉诃诊诂诋讵诈诒诏评诎诅词詟咏诩询诣试诗诧诟诡诠诘话该详诜诙诖诔诛诓夸志认诳诶诞诱诮语诚诫诬误诰诵诲说谁课谇诽谊调谄谆谈诿请诤诹诼谅论谂谀谍谝诨谔谛谐谏谕谘讳谙谌讽诸谚谖诺谋谒谓誊诌谎谜谧谑谑谡谤谦谥讲谢谣谟谪谬讴谨谩证谲讥谮识谯谭谱谵译议谴护誉谫读变雠谗让谰谶谠谳讱讻诇诐诪谞谷岂竖丰猪豮猫贝贝贞负财贡贫货贩贪贯责贮贳赀贰贵贬买贷贶费贴贻贸贺贲赂赁贿赅资贾贼赈赊宾赇赉赐赏赔赓贤卖贱赋赕质赍账赌赖赚赙购赛赜贽赘赠赞赡赢赆赃赎赝赣贠赒赗赟赪赶赵趋趱跖迹跶踏践踊跄跸蹒踪跷趸踌跻跃踯跞踬蹰跹蹑蹿躜躏躯车轧轨军轩轫轭软轷轸轱轴轵轺轲轶轼较辂辁载轾辄辅轻辆辎辉辋辍辊辇辈轮辑辏输辐辗舆毂辖辕辘转辙轿辚轰辔轹轳轪辀辌辒办辞辫辩农迳这连进进游运过达达违遥逊递远适迟迁选遗辽迈还迩边逻逦郁郏郄邮郓乡邹邬郧邓郑邻郸邺郐邝郦酦丑酝医酱酿衅酾酽释钆钇钌钊钉钋针钓钐钏钒钎钗钍钕钯钫钭钚钠钝钤钣钞钮钧钙钬钛钪铈钶铃钴钹铍钰钸铀钿钾钜钻铊铉铋铂钷钳铆铅钺钩钲钼钽铰铒铬铪银铳铜铣铨铢铭铫衔铑铷铱铟铵铥铕铯铐铞锐销锈锑锉铝锒锌钡铤铗锋锊锓铘锄锃锔锇铺锆锂铽锍锯钢锞录锖锫锩锥锕锟锤锱铮锬锭钱锦锚锡锢错锰铼锨钔锴锅镀锷铡锻锸锲锹锾键锶锗锺镁锿镑锁镉钨蓥镏铠锼镐镇镒镍镎镞镟链镆镙镝铿锵镗镛铲镜镖镂錾铧镤镪铙铴镣铹镦镡钟钟镫镢镨锎锏镌镰镯镭铁铎铛镱铸镬鉴镲铄镳镥镧钥镶镊镩锣銮凿钑钖钘铏铚铦铻锜锠锳锽镃镈镕镠镮镴长门闩闪闫闭开闶闳闰闲闲间闵闸阂阁阀闺闽阃阆闾阅阊阉阎阏阍阈阌阒闱阔阕阑阗阖阙闯关阚阐闼闬闿阇阓阘阛坂陉陕阵阴陈陆阳陧队阶陨际随险隐陇隶隽虽双雏杂鸡离难云电雾霁雳霭灵靓静面腼靥巩鞒缰鞑鞯韦韧韩韪韬鞴韫韨韵响页顶顷项顺顸须顼颂颀颃预顽颁顿颇领颌颉颐颏头颊颔颈颓频颗题额颚颜颛愿颡颠类颟颢顾颤颥显颦颅颞颧颋颎颒颙颣风飑飒飓飕飘飙飚飏飐飔飖飗飞饨饪饫饬饭饮饴饲饱饰饺饼饷养饵饽馁饿馀馄饯馅馆饧馇饩馏馊馍馒馐馑馓馈馔饥饶飨餍馋馕饦饳饸饹饻饾馂馃馉馌馎马马驭冯驮驰驯驳驻驽驹驵驾骀驸驶驼驷骈骇骆骏骋骓骒骑骐骛骗骞骘骝腾驺骚骟骡蓦骜骖骠骢驱骅骁骣骄验惊驿骤驴骧骥骊驲骃骍骎骔骕骙骦髅体髌髋鬓斗闹闹阋阄魉魇鱼鲁鲂鱿鲅鲆鲇鲐鲍鲋鲒鲕鲔鲛鲑鲜鲧鲠鲩鲤鲨鲻鲭鲞鲷鲴鲱鲵鲲鲳鲸鲮鲰鲶鲺鲫鳊鲽鳇鳅鳆鳃鳋鲥鳏鳎鳐鳍鲢鳌鳓鳘鲦鲣鳗鳔鳙鳕鳖鳟鳝鳜鳞鲟鲼鲎鳢鲚鳄鲈鲡鱽鱾鲀鲄鲉鲊鲌鲏鲓鲖鲗鲘鲙鲝鲪鲬鲯鲹鲾鲿鳀鳁鳂鳈鳉鳑鳒鳛鳠鳡鳣鸟凫鸠凤鸣鸢鸩鸨鸦鸵鸳鸲鸱鸪鸯鸭鸸鸹鸿鸽鸺鹃鹆鹁鹈鹅鹄鹉鹌鹏鹎鹊鸫鹑鹋鹕鹗鹛鹜莺鹤鹘鹣鹚鹞鹧鸥鸷鹨鸶鹪鹩鹫鹇鹬鹰鹭鹱鸬鹦鹳鹂鸾鸤鸧鸮鸰鸴鸻鸼鹀鹍鹐鹒鹓鹔鹖鹝鹟鹠鹡鹢鹥鹯鹲鹴卤咸鹾硷盐狍丽麦麸么黄黉点黡党黪霉黩黾鼋鼍鼌鼗鼹齄齐斋齑齿龀龅龇龃龆龄龈龊龉龋龌龁龂龙庞龚龛龟";
};

gm.ngi.weibo.TTSTextHandler.prototype.splice = function(status){

	// TODO: 微博正文或被转发的微博正文，在过滤后可能为空。需处理此时的拼接规则
	
	var pauseStr = "";
	var verifiedStr = status.user.verified ? "认证用户" : "";
	var userStr = status.user.screen_name;
	var dateStr = gm.ngi.weibo.utils.toFriendlyDate(new Date(status.created_at));	//TODO：转化为友好时间
	var statusStr = this.filter(status.text);
	
	if (status.retweeted_status){
		
		// 拼接规则：[认证用户](用户名)在(发布时间)转发了(被转发用户名)的一条微博：
		// (被转发微博正文)+停顿+(用户名)在转发时附加了自己的看法：(微博正文)

		var repostUserStr = status.retweeted_status.user.screen_name;
		var repostStatusStr = this.filter(status.retweeted_status.text);
		
		
		return verifiedStr + userStr + "在" + dateStr + "转发了" + repostUserStr + "的一条微博："
			+ repostStatusStr + pauseStr + userStr + "在转发时附加了自己的看法：" + statusStr;
	}else{
		
		// 拼接规则：[认证用户](用户名)在(发布时间)发布了一条新微博：(微博正文)
		
		return verifiedStr + userStr + "在" + dateStr + "发布了一条新微博 " + statusStr;
	}
};

gm.ngi.weibo.TTSTextHandler.prototype.filter = function(text){
	text = this.filterUrl(text);
	text = this.filterEmail(text);
	text = this.filterFullWidth(text);
	text = this.filterSymbols(text);
	text = this.filterTopic(text);
	text = this.filterTranditional(text);
	return text;
};

gm.ngi.weibo.TTSTextHandler.prototype.filterUrl = function(text){
	var reg = /http:\/\/t\.cn\/\w+/gi;
	return text.replace(reg, "");
};

gm.ngi.weibo.TTSTextHandler.prototype.filterEmail = function(text){
	return text;	// todo
};

gm.ngi.weibo.TTSTextHandler.prototype.filterSymbols = function(text){
	return text;	// todo
};

gm.ngi.weibo.TTSTextHandler.prototype.filterFullWidth = function(text){
	return text;	// todo
};

/*
 * 将文本中的繁体字转换为简体字
 */
gm.ngi.weibo.TTSTextHandler.prototype.filterTranditional = function(text){
	var newText = "";
	for(var i=0;i<text.length;i++){
		var index = BinarySearch(this.tranditionalChars, text[i]);
		newText += (index < 0) ? text[i] : this.simpleChars[index];
	}
	return newText;
	
	function BinarySearch(srcArray, target) {
		var low = 0;
		var high = srcArray.length - 1;
		while (low <= high) {
			var middle = (low + high) / 2;
			middle = Math.floor(middle);
			var compareResult = target.localeCompare(srcArray[middle]);
			if (compareResult == 0) {
				return middle;
			} else if (compareResult < 0) {
				high = middle - 1;
			} else {
				low = middle + 1;
			}
		}
		return -1;
	}
};

gm.ngi.weibo.TTSTextHandler.prototype.filterEmotions = function(text){
	return text;	// todo
};

gm.ngi.weibo.TTSTextHandler.prototype.filterTopic = function(text){
	var reg = /#(.+?)#/gi;
	return text.replace(reg, "$1");
};

